package ru.ssau.autotinderback.controller;

public class CarController {
    // Создание

    // Прикрепить фото

    // Изменение

    // Удаление

    // Получение всех своих

    // Получение своего одного

    // Получение машины для обмена

    // Лайк или дизлайк машине для аренды

    // Получение всех машин для продажи

    // Возврат машины(если она на продаже) ее инфы и инфа владельца

    // Посмотреть тех кто лайкал (для подписок)

    // Посмотреть тех кого дизлайкал (для подписок)

    // Посмотреть тех кто нас лайкал или дизлайкал (для подписок)
}
